app/controllers/lights_controller.rb

SELECT "lights".* FROM "lights" ORDER BY created_at desc
---
  def index
    if light_params[:dir] && light_params[:field]
      query =  light_params[:field].to_s +
        ' ' + light_params[:dir].to_s

      @lights = Light.order(query)

SELECT  "lights".* FROM "lights" WHERE "lights"."id" = $1 LIMIT $2  [["id", 81], ["LIMIT", 1]]
---
  def show
    @light = Light.find(params[:id])

INSERT INTO "lights" ("created_at", "updated_at", "latitude", "longitude", "status") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2018-02-21 04:08:42.415749"], ["updated_at", "2018-02-21 04:08:42.415749"], ["latitude", 0.002192583742190807], ["longitude", 0.001544952392578125], ["status", ""]]
---
  def create
    @light = Light.new(light_params)
    respond_to do |format|
      if @light.save

UPDATE "lights" SET "name" = $1, "status" = $2, "created_at" = $3, "updated_at" = $4 WHERE "lights"."id" = $5  [["name", "492"], ["status", "broken"], ["created_at", "2018-02-23 21:41:03.952000"], ["updated_at", "2018-02-23 21:50:14.609091"], ["id", 492]]
---
  def update
    respond_to do |format|
      if @light.update(light_params)

DELETE FROM "lights" WHERE "lights"."id" = $1  [["id", 66]]
---
  def destroy
    @light.destroy

SELECT  "lights".* FROM "lights" WHERE "lights"."id" = $1 LIMIT $2  [["id", 380], ["LIMIT", 1]]
---
    def set_light
      @light = Light.find(params[:id])